[
  { 
    "label": "Historical Innovations", 
    "image": "/assets/track1.svg",
    "description": "Draw inspiration from the contributions of Lovelace, Turing, and Babbage to create solutions or tools with historical significance.",
    "ideas": [
      "Ada's Algorithm Reimagined: Develop a modern application of Lovelace's work in algorithm design.",
      "Turing Machine Simulator: Create a virtual Turing machine that teaches computation fundamentals.",
      "Mechanical Marvels: Design an app or game that simulates Babbage's Difference Engine."
    ]
  },
  { 
    "label": "Cryptography", 
    "image": "/assets/track2.svg",
    "description": "Engage with encryption concepts, influenced by Turing's work on codebreaking.",
    "ideas": [
      "Cipher Challenges: Build a platform for learning and solving classic encryption techniques.",
      "Secure Messaging App: Prototype a lightweight, secure messaging system using modern cryptographic standards.",
      "Historical Cipher Re-creations: Simulate and crack World War II-era encryption methods (e.g., Enigma-like codes)."
    ]
  },
  { 
    "label": "Accessibility and Ethics", 
    "image": "/assets/track.png",
    "description": "Promote inclusivity in technology, addressing ethical concerns in CS.",
    "ideas": [
      "Accessible Coding: Develop tools that make programming accessible to people with disabilities.",
      "Bias Detector: Create a tool that analyzes code for potential biases in data or algorithms.",
      "Digital Ethics Quiz: Build an interactive quiz app to teach users about ethical decision-making in CS."
    ]
  },
  { 
    "label": "British Themed", 
    "image": "/assets/track4.svg",
    "description": "Solve real-world problems or enhance understanding of UK-based challenges using computational approaches.",
    "ideas": [
      "Transportation Planner: Optimize travel routes in London using public data APIs.",
      "Cultural Connect App: Help visitors engage with local history and landmarks.",
      "Climate Action Tool: Build a model for local climate impact analysis or community energy savings."
    ]
  }
]
